Revit 2027 API
AreaReinforcement.RemoveAreaReinforcementSystem Method
 Deletes the specified AreaReinforcement, and converts its RebarInSystem elements to equivalent Rebar elements.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static IList<ElementId> RemoveAreaReinforcementSystem(
	Document doc,
	AreaReinforcement system
)
Public Shared Function RemoveAreaReinforcementSystem (
	doc As Document,
	system As AreaReinforcement
) As IList(Of ElementId)
public:
static IList<ElementId^>^ RemoveAreaReinforcementSystem(
	Document^ doc,
	AreaReinforcement^ system
)
static member RemoveAreaReinforcementSystem :
        doc : Document *
        system : AreaReinforcement -> IList<ElementId>
Parameters
doc Document
 The document.
system AreaReinforcement
 An AreaReinforcement element in the document.
Return Value
IList<ElementId>
 The ids of the newly created Rebar elements.
Exceptions
Exception | Condition
ArgumentException |  The element system was not found in the given document. -or- system does not host Rebar.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
AreaReinforcement Class
Autodesk.Revit.DB.Structure Namespace